blogs/《重构》重构技巧之处理概括关系.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org04b23c0">1. Form Template Method</a></li>
<li><a href="#orgdbf9dab">2. Replace Inheritance with Delegation</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
这一章就是讲一些方法或字段在子类和超类中的重构，比如子类中相同的方法可以放在超类中，本质上还是为了避免重复
</p>
</blockquote>

<div id="outline-container-org04b23c0" class="outline-2">
<h2 id="org04b23c0"><span class="section-number-2">1</span> Form Template Method</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
塑造模板函数
当两个类中有类似的函数，哪怕不完全一样，可以通过塑造模板函数的方式提炼到超类，避免重复
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">TextStatement</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">value</span><span style="color: #8c8c8c;">(</span>name<span style="color: #8c8c8c;">)</span>
    result = <span style="color: #a3be8c;">'hi'</span>
    result += <span style="color: #a3be8c;">"</span><span style="color: #bf616a;">#{name}</span><span style="color: #a3be8c;"> \n"</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">HtmlStatement</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">value</span><span style="color: #8c8c8c;">(</span>name<span style="color: #8c8c8c;">)</span>
    result = <span style="color: #a3be8c;">'&lt;p&gt;hi&lt;/p&gt;'</span>
    result += <span style="color: #a3be8c;">"&lt;h1&gt;</span><span style="color: #bf616a;">#{name}</span><span style="color: #a3be8c;">&lt;/h1&gt;&lt;br \&gt;"</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>
<p>
这只是一个极端例子，两个方法中很多重复的时候，虽然不完全一样，也需要尽量避免重复
可以提炼出一个超类，构造一个“模板方法”，将两个子类方法中相同的地方（即模板）放到超类中
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Statement</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">value</span><span style="color: #8c8c8c;">(</span>name<span style="color: #8c8c8c;">)</span>
    result = greeting_string
    result += name_string
  <span style="color: #b48ead;">end</span>

  <span style="color: #d08770;">private</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">greeting_string;</span> <span style="color: #b48ead;">end</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">name_string;</span> <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">TextStatement</span> &lt; <span style="color: #c0c5ce;">Statement</span>
  <span style="color: #d08770;">private</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">greeting_string</span>
    <span style="color: #a3be8c;">'hi'</span>
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">name_string</span>
    <span style="color: #a3be8c;">"</span><span style="color: #bf616a;">#{name}</span><span style="color: #a3be8c;"> \n"</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">HtmlStatement</span> &lt; <span style="color: #c0c5ce;">Statement</span>
  <span style="color: #d08770;">private</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">greeting_string</span>
    <span style="color: #a3be8c;">'&lt;p&gt;hi&lt;/p&gt;'</span>
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">name_string</span>
    <span style="color: #a3be8c;">"&lt;h1&gt;</span><span style="color: #bf616a;">#{name}</span><span style="color: #a3be8c;">&lt;/h1&gt;&lt;br \&gt;"</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbf9dab" class="outline-2">
<h2 id="orgdbf9dab"><span class="section-number-2">2</span> Replace Inheritance with Delegation</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
用委托取代继承
</p>
</blockquote>
<p>
什么时候用委托取代继承：
</p>
<ol class="org-ol">
<li>本来就不是继承关系，概念上就不对，不能为了用一个相同的name方法，就让deal继承product对吧</li>
<li>只是用了另一个类里的少数方法，大多数方法都没用，这时候就可以用delegation</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.13)</p>
</div>
</div>
</body>
</html>
